{
  "personalInfo": {
    "name": "Anubhav Choubey",
    "contact": "+91 9131XXXXXX | choubey.anubhav253@gmail.com | anubhavchoubey.com",
    "links": "GitHub | LinkedIn | Kaggle | Jabalpur, Madhya Pradesh"
  },
  "experience": [
    {
      "id": "job1",
      "title": "Technical Intern @ Rozana.in (Onsite)",
      "date": "Jul 2025 – Present",
      "descriptions": [
        "Built a pipeline for automated image generation and editing using SOTA open-source models (Flux Krea Dev, Qwen Image Edit, Vision LLMs).",
        "Automated generation of display names, descriptions, and visual tags using Gemini API, and optimized Typesense queries for improved search relevance.",
        "Developed a pipeline to fetch, process, and deploy geofencing data for store coverage areas, enabling seamless production integration."
      ]
    },
    {
      "id": "job2",
      "title": "Deep Learning Intern @ Devnex Technologies",
      "date": "Sep 2024 – Jul 2025",
      "descriptions": [
        "Deployed open-source models (Flux, Flux Kontext, InternVL, Gemma, etc.) on HuggingFace Endpoints and Modal.com with quantized versions for efficient remote execution.",
        "Optimized model performance by reducing memory usage and runtime through parallel processing, multithreading, and pipelining.",
        "Collaborated in professional environments using ticket-based systems, Git workflows, and maintained thorough code documentation."
      ]
    },
    {
      "id": "job3",
      "title": "Intern @ Lexi.ai",
      "date": "May 2024 – Jun 2025",
      "descriptions": [
        "Developed a Django backend with a web-hosted SQL database, including MySQL schema design and robust validation for accurate data transmission.",
        "Contributed to website basic frontend development using HTML, CSS, JS (React)."
      ]
    },
    {
      "id": "job4",
      "title": "Freelancer",
      "date": "Sep 2023 – Sep 2024",
      "descriptions": [
        "Completed 15+ projects spanning Python, FastAPI, Django, Machine Learning, automation, and various Python frameworks."
      ]
    }
  ],
  "projects": [
    {
      "id": "project1",
      "title": "School Sphere – School Management System",
      "technologies": "(Python, FastAPI, Celery, Redis, JWT)",
      "descriptions": [
        "Engineered a secure backend with JWT-based authentication and multi-role access control, ensuring safe request handling and granular read/write permissions.",
        "Optimized performance using Redis-based class-level caching, Celery for task scheduling, and multithreading to reduce redundant processing and improve scalability.",
        "Followed industry best practices (logging, lazy loading, exception handling) while building with Python, FastAPI, Redis, Celery, and JWT for a production-ready system."
      ]
    }
  ],
  "skills": {
    "languages": "<b>Languages & Frameworks:</b> Python, Django, FastAPI, SQL",
    "ai": "<b>AI/ML & Deep Learning:</b> Prompting, ComfyUI, Pipelining, HuggingFace, CV, NLP, OpenCV, Inferencing"
  },
  "education": {
    "btech": "<b>B.Tech (Artificial Intelligence and Data Science):</b> JEC (Est. 1947) – 8.4* <span class=\"float-right italic\">Jul 2022 – Apr 2026</span>"
  },
  "accomplishments": [
    "Led 'Team Conquerors!' to SIH'24 Finals.",
    "LeetCode: Solved 200+ problems in Data Structures and Algorithms."
  ]
}
